<script setup lang="ts">
import { onMounted, ref } from 'vue'
import { useRoute } from 'vue-router'

import type { Place } from '../types/Place.d'
import { apiClient } from '../utils/apiClient'

const route = useRoute()
const place = ref<Place | null>()

// onMounted(async () => {
//   place.value = await apiClient.get<Place>({ url: `/place/${route.params.id}` })
// })
</script>

<template>
  <div class="mt-10 rounded-xl p-10 w-4/5 bg-white m-auto flex flex-col gap-15 shadow-xl">
    <div>
      <div>
        <h2 class="text-lg font-bold">1920-1930</h2>
        <h1 class="text-2xl font-bold">Зарождение</h1>
      </div>
      <div>
        Радиевый институт был создан в 1922 году по инициативе и под руководством академика В.И.
        Вернадского путем объединения всех имевшихся к тому времени в Петрограде радиологических
        учреждений: Радиевой лаборатории Академии наук, Радиевого отделения Государственного
        рентгенологического и радиологического института и Радиохимической лаборатории. В плане
        научного руководства новому институту были подчинены радиевый рудник и завод в Бондюге
        (Татарстан). На этом заводе В.Г. Хлопиным и М.А. Пасвик в декабре 1921 года были получены
        первые в России высокообогащенные препараты радия. Государственный Радиевый институт стал
        центром, в котором зародилась и проходила становление отечественная атомная наука и
        техника...
      </div>
    </div>
    <div>
      <div>
        <h2 class="text-lg font-bold">1930-1940</h2>
        <h1 class="text-2xl font-bold">Становление института</h1>
      </div>
      <div>
        В 1932 г. началось создание в Радиевом институте первого в Европе циклотрона. Циклотрон
        позволил приступить к изучению сделанного в 1938 г. открытия О. Ганом и Ф. Штрассманом
        процесса деления ядер урана под действием нейтронов. Большим событием явилось участие
        сотрудников Радиевого института в открытиях явления изомерии искусственных радиоактивных
        ядер (1935 г. с участием Л.В. Мысовского) и спонтанного деления ядер урана (1940 г. с
        участием К.А. Петржака). В 1940-е годы Президиум АН СССР создал «Урановую комиссию» во главе
        с директором Радиевого института В.Г. Хлопиным. Комиссией рассматривались вопросы поиска
        месторождений урана, с возможностью осуществления цепной реакции в природной и обогащенной
        по урану-235 смеси, разработки методов разделения изотопов урана и другие...
      </div>
    </div>
  </div>
</template>
